[
{"price": [], "title": ["\n", "\n", "\n", "\n", "\n", "\n", "\nFabulous 1 bedroom city centre flat for short term, holiday or corporate let\n", "\nSalford, Manchester\n", "\nGreat Twin Rooms, For 2 Friends Sharing, in Clean and Friendly Shared House, Zone 2. All bills inc.\n", "\nWillesden, London\n", "\nOne bedroom flat to rent in Maida Vale W9\n", "\nWestminster, London\n", "\n1 BEDROOM, STRATFORD HIGH ST, E15\n", "\nLondon\n", "\nRent offices in Brentwood from £111 p/w\n", "\nBrentwood, Essex\n", "\n2 bedroom flat in Cashmere House, 37 Leman Street, Aldgate East\n", "\nLondon\n", "\n1 bedroom flat in Jubilee Court, 20 Victoria Parade, Greenwich\n", "\nIsle of Dogs, London\n", "\n1 bedroom flat in Crawford Building, 112 Whitechapel High Street, Aldgate\n", "\nLondon\n", "\n2 bedroom flat in Westgate Apartments, Western Gateway, Docklands\n", "\nCanning Town, London\n", "\nStudio flat in Ivy Point, Hannaford Walk, , Bromley by Bow\n", "\nLondon\n", "\n1 bedroom flat in Baltimore Wharf, North Boulevard, Canary Wharf\n", "\nLondon\n", "\n2 bedroom flat in Marc Brunel House, 136 Wapping High Street, Wapping\n", "\nTower Hamlets, London\n", "\n2 bed 2 bath flat in Aldgate East, balcony, very spacious, tiled flooring, underfloor heating, furn\n", "\nAldgate, London\n", "\n20th floor one bedroom flat in Elektron Tower, E14, with parking, electric, heating, water included\n", "\nDocklands, London\n", "\nL@@K at this stunning 2 bedroom 2 bath flat, E1 7AQ, directly above Aldgate tube station, city views\n", "\nAldgate, London\n", "\n2 bedroom flat in Trinity Tower, 28 Quadrant Walk, Canary Wharf\n", "\nLondon\n", "\n3 bedroom flat in Charrington Tower, Biscayne Avenue, Canary Wharf\n", "\nPoplar, London\n", "\nStunning Flat!!! Short Let, 1 month minimum - 15'Bond Street on the Jubilee line **\n", "\nWest Hampstead, London\n", "\nMost beautiful 2 bed top floor flat + roof terrace, Flexible lease - 10'Baker Street by tube\n", "\nWest Hampstead, London\n", "\nShort let London / Gorgeous place with en-suite / Central Location close to station.\n", "\nPutney, London\n", "\nSecond floor one bedroom flat right next to East India DLR, Elektron Tower, gym, BILLS INCLUDED\n", "\nCanary Wharf, London\n", "\nStunning luxury one bedroom designer flat in Altitude Point, E1, porter, 25th floor roof terrace,\n", "\nAldgate, London\n", "\nAmazing 2 bed 2 bath 11th floor flat in Altitude Point, E1, balcony, 25th floor roof terrace, porter\n", "\nLondon\n", "\nOne bedroom flat in Elektron Tower with bills included. Balcony, gym, 24hr porter, East India DLR\n", "\nDocklands, London\n", "\n28th floor one bedroom, Pan Peninsula, E14, 24hr concierge, cinema, pool, gym, cocktail bar, balcony\n", "\nLondon\n", "\nOne bedroom luxury flat in the new Sterling Mansions, E1, porter, gym, 5 mins to Aldgate East\n", "\nAldgate, London\n", "\nNEW NEW one bedroom flat on 6th floor, Aldgate Place, Wiverton Tower, E1, 24hr porter, high spec\n", "\nAldgate, London\n", "\nSpacious 2 bed 2 bath flat in Baltimore Wharf, E14, private balcony, gym, 24hr concierge, pool, spa\n", "\nIsle of Dogs, London\n", "\n3rd floor ONE BEDROOM FLAT in new CHARRINGTON TOWER, NEW PROVIDENCE WHARF, E14 9AY, porter, gym\n", "\nPoplar, London\n", "\nOne bedroom flat within 5 minutes of Canary Wharf, gym, pool, 24hr porter, secure parking, balcony\n", "\nIsle of Dogs, London\n"], "description": ["\n", "\n", "\n", "\n", "\n", "\n", "\nThis spacious city centre 1 bedroom apartment offers business travellers and tourists a practical and affordable alternative to a hotel.\r\nRENT FOR THIS APARTMENT IS £385 PER WEEK, INCLUDING ALL BILLS .*\r\nThere are other price options for stay\n", "\nWe're offering two comfortable and bright twin rooms, for 2 friends sharing, in a clean and well-maintained shared house, offering friendly and homely atmosphere.\r\nLocated in different houses but next to each other, situated about 10 minutes walk f\n", "\nOne bedroom flat to rent in Maida Vale W9\r\nWe are happy to offer this cosy one bedroom flat situated on the first floor in a four storey building.\r\nThe flat consists of :\r\nOne bedroom\r\nHall\r\nToilet with bathroom\r\nOpen plan kitchen / Livingroom\r\nTh\n", "\nLocated in a desirable location of Stratford, Filtons are pleased to offer this lovely 1 bedroom apartment. The property consists of a good sized bedroom and open plan living/ dining area.\r\nEasy commute to Stratford underground station and Westfiel\n", "\nRent offices in Brentwood from £111 p/w for viewings please call\r\n* 0203 002 3529 *\r\nPricing:\r\nThere are various office floor plan configurations available at flexible terms for immediate occupancy and you are assured of entirely transparent, si\n", "\nA luxury two bedroom two bathroom, third floor apartment set within Goodman's Fields, Berkeley Homes' latest flagship development located in this fantastic E1 central London location.Goodman's Fields is ideally placed for an unrivalled selection of l\n", "\nAbby Properties are pleased to offer this 7th floor, one bedroom apartment. This modern flat is finished to a high specification, including fully integrated appliances as well as modern, stylish furniture. Residents of the New Capital Quay developmen\n", "\n19th floor one bedroom flat in Crawford Building, E1. Fully furnished. 24hr porter. Directly above Aldgate Station and ready to move in now. Contact us onfor more pictures and information.\n19th floor one bedroom flat in Crawford Building, E1. Full\n", "\nThis immaculate two double bedroom, two bathroom apartment on the 2nd floor of Westgate Apartments. With a bright aspect, the property features a semi open plan kitchen and reception room, full length balcony, en suite facilities to the master bedroo\n", "\nAbby Properties present this studio suite apartment situated in this stylish tower by Barratt Homes ideally located next to Bromley-by-Bow tube station. The property boasts approximately 389 sq ft of living space, living/dining area with private balc\n", "\nAbby Properties present this stunning 10th floor, one double bedroom, designer furnished, dockside apartment. The property features access to a private balcony with views towards Canary Wharf, a fully integrated kitchen, wooden flooring to the recept\n", "\nAbby Properties are pleased to offer this beautiful two bedroom two bathroom first floor apartment, located within Wapping's newest development- Wapping Riverside. This stunning new build apartment spanning over 1,000 sq ft, in a river fronted develo\n", "\nAbby Properties present this luxury 5th floor flat set within Leman Street benefiting from two bedrooms two luxury bathroom suites and conveniently located next to Aldgate East tube station. These luxury apartments are ideal for those who demand the\n", "\nAbby Properties present this modern one bedroom 20th floor apartment with balcony in the Elektron development, located within 50m of East India DLR station for easy access to Canary Wharf & The City. The development benefits from 24 hour concierge &\n", "\nA two bedroom two bathroom apartment situated on the 14th floor of this fantastic development offering stunning views. This stylish apartment features high specification throughout and offers a fully fitted contemporary kitchen, door entry system, fi\n", "\nTwo bedroom flat to rent in Trinity Tower, E14. A stunning two bedroom three bathroom luxury flat on the 14th floor of a fantastic modern development, boasting two en suites to both master bedrooms, floor-to ceiling windows boasting impressive views\n", "\nAbby Properties present this stunning 25th floor three bedroom two bathroom duplex flat in the new Charrington Tower which is part of the New Providence Wharf development, E14. With breathtaking river and O2 Arena views this spacious apartment compri\n", "\nAvailable to move in immediately!\r\n*Special offer valid for 1 month - Full price is £445pw**\r\n**Short Let minimum 1 month**\r\nALL UTILITY BILLS INCLUDED / FREE INTERNET\r\nIdeally located BRAND NEW flat has just been refurbished and is fully fu\n", "\n**SPECIAL OFFER** FULL PRICE IS £745PW**\r\nAvailable from 22nd February\r\nShort or Long Let , Flexible lease!!!!!!\r\nAll bills, water, gas, electricity and internet are included.\r\nluxury 2 double bedroom fully furnished with fully equipped kitc\n", "\nSpacious apartment available to rent within a gorgeous semi-detached house moments away from the underground station at East Putney. It boasts fantastic transport links into the City and Central London.\r\nHouse is clean spacious, fully furnished ki\n", "\nAbby Properties present this one bedroom second floor apartment which boasts a good size balcony, fully fitted kitchen, quality furnishings, very clean condition and a modern luxurious bathroom with power shower. Reassurance of uniformed concierge on\n", "\nA luxury, one double bedroom apartment set within this stunning high rise building in Tower Hill. This contemporary property is offered designer furnished and features a fully integrated kitchen, balcony with breath-taking views and fully tiled bathr\n", "\nA good sized two bedroom two bathroom apartment set on the 11th floor of this fantastic high rise building in Tower Hill. This contemporary property is offered designer furnished and features a luxury fully integrated kitchen, Amtico flooring in the\n", "\nOne bedroom apartment to rent in Elektron Tower, E14. This apartment boasts a good size balcony, fully fitted kitchen, quality furnishings, very clean condition and a modern luxurious bathroom with power shower. Reassurance of uniformed concierge on\n", "\nA good size one double bedroom apartment situated on the 28th floor of this fantastic hirise development. The property features a balcony, fitted wardrobes, fully integrated open-plan kitchen, marble bathroom and access to the gym, pool, cockail bar,\n", "\nA luxurious one bedroom apartment situated on the first floor of this modern development by Berkeley Homes. This stunning apartment is offered designer furnished and features a spacious living area with a fully fitted open plan kitchen, built in ward\n", "\nAbby Properties present this brand new, dual aspect, one bedroom luxury apartment set on the sixth floor of Aldgate Place E1. The property benefits from a spacious open plan living room with fully integrated kitchen, 2 luxury bathrooms and private wi\n", "\nA two bedroom two bathroom apartment with private balcony situated close to Canary Wharf Jubilee line tube station and Crossharbour DLR. The property is offered designer furnished and features high specification, wood flooring to the hallway, 24 hour\n", "\nExceptional interiors offering 576 sq.ft of enviable living. Situatied on the 3rd floor in the prestigious Charrington Tower (Providence Tower), Canary Wharf. Boasting a modern design with an open-plan living space, floor to ceiling windows with exce\n", "\nAbby Properties present this modern recently refurbished one double bedroom apartment in this much desired Cascades development. The property is situated on the first floor with stunning views of the Thames and has 24 hour concierge, recently fitted\n"], "image_urls": ["https://www.gumtree.com/static/1/resources/assets/rwd/images/orphans/a37b37d99e7cef805f354d47.noimage_thumbnail.png", "https://www.gumtree.com/static/1/resources/assets/rwd/images/orphans/a37b37d99e7cef805f354d47.noimage_thumbnail.png", "https://www.gumtree.com/static/1/resources/assets/rwd/images/orphans/a37b37d99e7cef805f354d47.noimage_thumbnail.png", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/-okAAOSwjDZYkgh1/$_99.JPG", "https://i.ebayimg.com/00/s/NzY4WDEwMjQ=/z/-okAAOSwjDZYkgh1/$_99.JPG", "https://i.ebayimg.com/00/s/NzIwWDk2MA==/z/SwMAAOSwTM5Ys~v4/$_99.JPG", "https://i.ebayimg.com/00/s/NzIwWDk2MA==/z/SwMAAOSwTM5Ys~v4/$_99.JPG", "https://i.ebayimg.com/00/s/NjgzWDEwMjQ=/z/93sAAOSwNnRYh5uL/$_99.JPG", "https://i.ebayimg.com/00/s/NjgzWDEwMjQ=/z/93sAAOSwNnRYh5uL/$_99.JPG", "https://i.ebayimg.com/00/s/NjgzWDEwMjQ=/z/UDUAAOSw44BYGiAI/$_99.JPG", "https://i.ebayimg.com/00/s/NjgzWDEwMjQ=/z/UDUAAOSw44BYGiAI/$_99.JPG", "https://i.ebayimg.com/00/s/MzQwWDQ1NA==/z/14oAAOSwLEtYkGct/$_99.JPG", "https://i.ebayimg.com/00/s/MzQwWDQ1NA==/z/14oAAOSwLEtYkGct/$_99.JPG", "", "https://i.ebayimg.com/00/s/NDI2WDY0MA==/z/CfIAAOSwdzVXmzSi/$_99.JPG", "", "https://i.ebayimg.com/00/s/NDI2WDY0MA==/z/p8IAAOSwmLlX9-pJ/$_99.JPG", "", "https://i.ebayimg.com/00/s/NDQ0WDYzOQ==/z/ZVEAAOSwbsBXm6HN/$_99.JPG", "", "https://i.ebayimg.com/00/s/NDI1WDYzOQ==/z/UQAAAOSw2xRYSXsy/$_99.JPG", "", "https://i.ebayimg.com/00/s/NDI2WDYzOQ==/z/NN4AAOSwHMJYME0m/$_99.JPG", "", "https://i.ebayimg.com/00/s/Mzk5WDU5NQ==/z/PGEAAOSw44BYFOeq/$_99.JPG", "", "https://i.ebayimg.com/00/s/Mzk3WDYzOQ==/z/UO8AAOSwLF1X8~fY/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjgyWDEwMjQ=/z/1mQAAOSw2xRYb956/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjM2WDEwMjQ=/z/rkcAAOSw3v5YnaiK/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjgyWDEwMjQ=/z/0C0AAOSwOVpXWEGa/$_99.JPG", "", "https://i.ebayimg.com/00/s/MzU5WDY0MA==/z/AjIAAOSw2xRYk0Vv/$_99.JPG", "", "https://i.ebayimg.com/00/s/NDI2WDYzOQ==/z/m80AAOSwYIxX9OOu/$_99.JPG", "", "https://i.ebayimg.com/00/s/NTMzWDgwMA==/z/1K8AAOSwImRYLayX/$_99.JPG", "", "https://i.ebayimg.com/00/s/NzAyWDEwMjQ=/z/cmUAAOSwjDZYdOPc/$_99.JPG", "", "https://i.ebayimg.com/00/s/MTAyNFg3NjU=/z/4JwAAOSwosFUU8Ww/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjgzWDEwMjQ=/z/AiYAAOSw4A5YsEaY/$_99.JPG", "", "https://i.ebayimg.com/00/s/Njg0WDEwMjQ=/z/IXYAAOSwpzdWqiql/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjgzWDEwMjQ=/z/38gAAOSwL7VWrNpT/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjgxWDEwMjQ=/z/E~4AAOSwEzxYeNTd/$_99.JPG", "", "https://i.ebayimg.com/00/s/NDAwWDU5Ng==/z/QmgAAOSwFMZWq6PP/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjgwWDEwMjQ=/z/PiAAAOSwa-dWqkwn/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjgyWDEwMjQ=/z/MlMAAOSw0fhXkOg9/$_99.JPG", "", "https://i.ebayimg.com/00/s/Njg3WDEwMjQ=/z/UxUAAOSw~oFXH6PI/$_99.JPG", "", "https://i.ebayimg.com/00/s/NDY2WDY4Nw==/z/YNcAAOSwGXtXh5se/$_99.JPG", "", "https://i.ebayimg.com/00/s/NjgyWDEwMjQ=/z/aYIAAOSwQNRXLLlZ/$_99.JPG"], "address": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n"]}
]